# Assignment #8 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Tori Hogrebe
</br>
Date: 04/10/2025
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy on our local server and locally on our machine.
- Populated our databases with the data we cleaned at the start of the semester.
<br>

Now we will **JOIN** our knowledge and tables to answer more complex questions about our dataset! We will practice joining tables and understand the importance of using different commands.<br>

JOIN statements are used to combine results from two or more tables based on a related column between them.<br>

Review the powerpoint and readings specified on Blackboard.<br>

In the event your database does not meet the requirements below to answer the question, please use the database provided in Assignment #4 and #5. Remember to credit your data source. <br>

Follow the instructions below to complete the assignment. Write your question you are answering with your data query and visualize your results in a way that fits your data. <br>
Be sure to comment **all** code and answer **all** questions in markdown for full credit.<br>

In [2]:
from sqlalchemy import create_engine, text
import pandas as pd

# Connect to the same database used in Assignment 7
engine = create_engine("mysql+mysqlconnector://root:milo200282@localhost/education_career_db")

#### INNER JOIN (or JOIN)
Display matching records from TWO tables! Choose to combine two tables using inner join. <br>
Write your question you are answering with your data query and visualize your results. <br>
<br>
**Question:** What is the average number of internships completed by students with a university GPA above 3.5?
<br>
**What tables are we joining?** academics and skills

In [4]:
from sqlalchemy import text

# SQL query using INNER JOIN
query = text("""
    SELECT a.Student_ID, a.University_GPA, s.Internships_Completed
    FROM academics a
    INNER JOIN skills s ON a.Student_ID = s.Student_ID
    WHERE a.University_GPA > 3.5
""")

# Run and display results
with engine.connect() as connection:
    result = pd.read_sql(query, connection)

result.head()

  Student_ID  University_GPA  Internships_Completed
0     S00001            3.96                      3
1     S00002            3.63                      4
2     S00006            3.78                      2
3     S00007            3.83                      0
4     S00016            3.61                      3

#### LEFT JOIN
**Question:** What are students' current job levels in relation to their field of study?

**Tables being joined:**  
- `academics` (provides Field_of_Study)  
- `career_outcomes` (provides Current_Job_Level)

In [32]:
from sqlalchemy import text

query = text("""
    SELECT 
        c.Student_ID,
        a.Field_of_Study,
        c.Current_Job_Level
    FROM academics a
    RIGHT JOIN career_outcomes c 
        ON a.Student_ID = c.Student_ID
    WHERE c.Current_Job_Level IS NOT NULL
""")

with engine.connect() as connection:
    job_match_df = pd.read_sql(query, connection)

job_match_df.head()

  Student_ID    Field_of_Study Current_Job_Level
0     S00001              Arts             Entry
1     S00002               Law               Mid
2     S00003          Medicine             Entry
3     S00004  Computer Science               Mid
4     S00005       Engineering             Entry

## RIGHT JOIN
**Question:**  
How does Networking Score relate to Career Satisfaction?

**What tables are we joining?**  
- Left table: `skills` (includes Networking Score)  
- Right table: `career_outcomes` (includes Career Satisfaction)

In [30]:
from sqlalchemy import text

query = text("""
    SELECT 
        c.Student_ID, 
        s.Networking_Score, 
        c.Career_Satisfaction
    FROM career_outcomes c
    RIGHT JOIN skills s ON s.Student_ID = c.Student_ID
""")

with engine.connect() as connection:
    right_join_df = pd.read_sql(query, connection)

right_join_df.head()

  Student_ID  Networking_Score  Career_Satisfaction
0     S00001                 8                    4
1     S00002                 1                    1
2     S00003                 9                    9
3     S00004                 6                    7
4     S00005                 9                    9

#### Notes on Scales:

- **Networking_Score** is rated on a scale of **0 to 10**, with **10 being the highest** possible score.
- **Career_Satisfaction** is also rated on a scale of **0 to 10**, where a **higher score indicates greater satisfaction**.  
  *(e.g., 10 likely represents maximum.)*

#### FULL JOIN or UNION of RIGHT JOIN and LEFT JOIN

Returns all records when there is a match in **either** left or right table. This allows us to combine results from both `academics` and `skills` â€” even if a student appears in only one of them.

**Question:**  
What are the University GPA and number of projects completed for each student?

**What tables are we joining?**  
`academics` and `skills` (joined using `Student_ID`)

In [40]:
query = text("""
    SELECT 
        a.Student_ID, 
        a.University_GPA, 
        s.Projects_Completed
    FROM academics a
    LEFT JOIN skills s ON a.Student_ID = s.Student_ID

    UNION

    SELECT 
        s.Student_ID, 
        a.University_GPA, 
        s.Projects_Completed
    FROM skills s
    LEFT JOIN academics a ON s.Student_ID = a.Student_ID
    WHERE a.Student_ID IS NULL
""")

with engine.connect() as connection:
    full_join_df = pd.read_sql(query, connection)

full_join_df.head()

  Student_ID  University_GPA  Projects_Completed
0     S00001            3.96                   7
1     S00002            3.63                   7
2     S00003            2.63                   8
3     S00004            2.81                   9
4     S00005            2.48                   6